_posts/2021-12-31-boj-2213.html
---
layout: post
title: BOJ 2213 트리의 독립집합
tags: DP dfs Tree
---

<div id="outline-container-org1f0e45f" class="outline-2">
<h2 id="org1f0e45f">BOJ 2213 트리의 독립집합</h2>
<div class="outline-text-2" id="text-org1f0e45f">
<ul class="org-ul">
<li>tree 구조에서 DP를 적용하는 문제</li>
</ul>
</div>
</div>

<div id="outline-container-org0fd4046" class="outline-2">
<h2 id="org0fd4046">접근하기</h2>
<div class="outline-text-2" id="text-org0fd4046">
<pre class="example">
               1 3 5 7을 선택하면 
  1            10 + 40 + 20 + 70 = 140
  |
  2
 / \
3   6 
|   |
4   7
|
5

</pre>
</div>
</div>


<div id="outline-container-org35c21f7" class="outline-2">
<h2 id="org35c21f7">코드</h2>
<div class="outline-text-2" id="text-org35c21f7">
<div class="org-src-container">
<pre class="src src-cpp">i#<span style="color: #8ae234; font-weight: bold;">include</span> &lt;bits/stdc++.h&gt;

<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[10010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">done</span>[10010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[10010][2];
<span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">G</span>[10010];   <span style="color: #888a85;">// </span><span style="color: #888a85;">&#51064;&#51217;&#47532;&#49828;&#53944;</span>
<span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">ans</span>;

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">dfs</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>)
{
    done[num] = 1;
    dp[num][0] = 0;     <span style="color: #888a85;">// </span><span style="color: #888a85;">&#46021;&#47549; X</span>
    dp[num][1] = a[num];<span style="color: #888a85;">// </span><span style="color: #888a85;">&#46021;&#47549; O</span>

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span>&amp; <span style="color: #ff6347;">next</span>:G[num]) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (!done[next]) {
            dfs(next);
            dp[num][1] += dp[next][0];                  <span style="color: #888a85;">// </span><span style="color: #888a85;">&#46021;&#47549; -&gt; &#45796;&#51020;&#51008; &#51068;&#48152;</span>
            dp[num][0] += max(dp[next][0], dp[next][1]);<span style="color: #888a85;">// </span><span style="color: #888a85;">&#51068;&#48152; -&gt; &#45796;&#51020;&#51008; &#46021;&#47549;/&#51068;&#48152;</span>
        }
    }
}

<span style="color: #888a85;">// </span><span style="color: #888a85;">path&#47484; &#52636;&#47141;&#54616;&#44592;</span>
<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">walk</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">prev</span>) 
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (dp[num][1] &gt; dp[num][0] &amp;&amp; !done[prev]) {
        done[num] = 1;
        ans.push_back(num);
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span>&amp; <span style="color: #ff6347;">next</span>:G[num]) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (next != prev) {
            walk(next, num);
        }
    }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;a[i]);
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N-1;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>, <span style="color: #ff6347;">p2</span>;
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;p1, &amp;p2);
        G[p1].push_back(p2);
        G[p2].push_back(p1);
    }
    dfs(1);             <span style="color: #888a85;">// </span><span style="color: #888a85;">1&#48264;&#51012; root&#47196; dfs&#47196; dp table &#52292;&#50864;&#44592;</span>
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, max(dp[1][0], dp[1][1]));
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) done[i] = 0;

    walk(1, 0);
    sort(ans.begin(), ans.end());
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span> <span style="color: #ff6347;">o</span>:ans) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d "</span>, o);
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"\n"</span>);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org67e6f33" class="outline-2">
<h2 id="org67e6f33">문제 링크</h2>
<div class="outline-text-2" id="text-org67e6f33">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/2213">https://www.acmicpc.net/problem/2213</a></li>
</ul>
</div>
</div>

<div id="outline-container-org338291c" class="outline-2">
<h2 id="org338291c">풀이 참고</h2>
<div class="outline-text-2" id="text-org338291c">
<ul class="org-ul">
<li><a href="https://kth990303.tistory.com/158">https://kth990303.tistory.com/158</a></li>
</ul>
</div>
</div>
